<template lang="pug">
.page
  TopHead(color="#fff")
    h1(style="color: #000;") TERMS
  .content
    h1 利用規約
    | 2021年1月16日 制定 2021年10月20日改定
    hr(noshade='noshade')
    | 本利用規約（以下「本規約」と呼びます）には,本サービスの提供条件及びサイト運営者（以下「当方」と呼びます）とユーザーの皆様との間の権利義務関係が定められています. 本サービスの利用に際しては,本規約の全文をお読みいただいたうえで,本規約に同意いただく必要があります.
    h2 第1条（適用）
    ol
      li 本規約は,本サービスの提供条件及び本サービスの利用に関する当方とユーザーとの間の権利義務関係を定めることを目的とし, ユーザーと当方との間の本サービスの利用に関わる一切の関係に適用されます.
      li 本規約の内容と,本規約外における本サービスの説明等とが異なる場合は,本規約の規定が優先して適用されるものとします.
    h2 第2条（定義）
    p 本規約において使用する以下の用語は,各々以下に定める意味を有するものとします.
      ol
        li 「知的財産権」とは,著作権,特許権,実用新案権,意匠権,商標権その他の知的財産権（それらの権利を取得し,またはそれらの権利につき登録等を出願する権利を含みます.）を意味します.
        li 「当ウェブサイト」とは,そのドメインが「0115765.com」「*.ic731.net(サブドメイン含む)」である,当方が運営するウェブサイト（理由の如何を問わず,当方のウェブサイトのドメインまたは内容が変更された場合は, 当該変更後のウェブサイトを含みます.）を意味します.
        li 「本サービス」とは,当方が提供するサービス（理由の如何を問わずサービスの名称または内容が変更された場合は,当該変更後のサービスを含みます.）を意味します.
    h2 第3条（禁止事項）
    p ユーザーは,本サービスの利用にあたり,以下の行為をしてはなりません.
    ol
      li 犯罪行為に関連する行為
      li サーバーまたはネットワークの機能を破壊したり,妨害したりする行為
      li サービスの運営を妨害するおそれのある行為
      li 不正アクセスをし,またはこれを試みる行為
      li 他のユーザーに関する個人情報等を収集または蓄積する行為
      li 不正な目的を持って本サービスを利用する行為
      li 故意な必要以上のサーバーリソースの消費等,著しくサービス提供を阻害する行為
      li その他,当方が不適切と判断する行為
    h2 第4条（本サービスの提供の停止等）
    ol
      li 運営者は,以下のいずれかの事由があると判断した場合,ユーザーに事前に通知することなく本サービスの全部または一部の提供を停止または中断することができるものとします.
      ol
        li 本サービスにかかるコンピュータシステムの保守点検または更新を行う場合
        li 地震,落雷,火災,停電または天災などの不可抗力により,本サービスの提供が困難となった場合
        li コンピュータまたは通信回線等が事故により停止した場合
        li その他,運営者が本サービスの提供が困難と判断した場合
      li 運営者は,本サービスの提供の停止または中断により,ユーザーまたは第三者が被ったいかなる不利益または損害についても,一切の責任を負わないものとします.
    h2 第5条（保証の否認及び免責）
    ol
      li 当方は,本サービスがユーザーの特定の目的に適合すること,期待する機能・商品的価値・正確性・有用性を有すること, ユーザーによる本サービスの利用がユーザーに適用のある法令または業界団体の内部規則等に適合すること, 継続的に利用できること,及び不具合が生じないことについて,明示又は黙示を問わず何ら保証するものではありません.
      li 当方は,本サービスに関してユーザーが被った損害について賠償する責任を負わないものとし,また,付随的損害,間接損害,特別損害,将来の損害及び逸失利益にかかる損害については, 賠償する責任を負わないものとします.
      li 本サービスまたは当方ウェブサイトに関連してユーザーと他のユーザーまたは第三者との間において生じた取引,連絡,紛争等については,ユーザーが自己の責任によって解決するものとします.
    h2 第6条（本サービスの内容の変更,終了）
    ol
      li 当方は,当方の都合により,本サービスの内容を変更し,または提供を終了することができます.
      li 当方が本サービスの提供を終了する場合,当方はユーザーに事前に通知するものとします.
    h2 第7条（利用規約の変更）
    ol
      li 運営者は,必要と判断した場合には,ユーザーに通知することなくいつでも本規約を変更することができるものとします. なお,本規約の変更後,本サービスの利用を開始した場合には,当該ユーザーは変更後の規約に同意したものとみなします.
    h2 第8条（権利義務の譲渡の禁止）
    ol
      li ユーザーは,運営者の書面による事前の承諾なく,利用契約上の地位または本規約に基づく権利もしくは義務を第三者に譲渡し,または担保に供することはできません.
    h2 第9条（分離可能性）
    ol
      li 本規約のいずれかの条項またはその一部が,消費者契約法その他の法令等により無効または執行不能と判断された場合であっても, 本規約の残りの規定及び一部が無効または執行不能と判断された規定の残りの部分は,継続して完全に効力を有するものとします.
    h2 第10条（準拠法・裁判管轄）
    ol
      li 本規約の解釈にあたっては,日本法を準拠法とします.
      li 本サービスに関して紛争が生じた場合には,運営者の本店所在地を管轄する裁判所を専属的合意管轄とします.
    h2 規約更新情報
    | (2021-10-20追記)
    strong 当利用規約の有効範囲に「*.ic731.net」を追加しました.
    | 該当ドメインで提供してある全てのサービスにおいて当利用規約は効力を有します.
    hr(noshade='noshade')
    | ※利用規約並びにサービス提供者に関するお問い合わせは
    nuxt-link(to="/contact") 総合お問い合わせフォーム
    | からご連絡頂ますよう宜しくお願い致します.
</template>

<script>
import TopHead from "~/components/TopHead.vue";
export default {
  name: "contact",
  components: {
    TopHead,
  },
  head() {
    return {
      title: "共通利用規約 | ic731.net",
    };
  },
};
</script>

<style lang="scss" scoped>
.content {
  padding-top: 2rem;
  padding-bottom: 2rem;
  width: 90%;
  margin: 0 auto;
  max-width: 900px;
}
</style>
